{"pageProps":{"id":"3391833eb055c363dcc54bdb4f54f73b","html":"<h1>Hip-Hop-crisy</h1>\n<p>Here are a few stanzas from Blueface's hit song Thotiana (a personified rendition of the word thot, which is just a new age spin on the word ho):</p>\n<blockquote>\n<p>Ain't no running, Thotiana, you gon' take these damn strokes (Thotiana)<br>\nI beat the pussy up, now it's a murder scene<br>\nKeep shit player Thotiana like you ain't never even heard of me (Blueface, baby)<br>\nBust down, Thotiana, I wanna see you bust down (bust down)<br>\nBend that shit over, yeah, aight (bend it over)<br>\nNow make that shit clap on the gang (make it clap)<br>\nNow toot that thing up (toot it up), throw that shit back (throw it back)<br>\nI need my extras on the dead locs</p>\n</blockquote>\n<p>Violent. Misogynistic. Perversely archaic. Yet, as far as mainstream hip hop is concerned, lyrics like these are commonplace. But it's also 2019 and for the past two years, individual after individual has been publicly decried for participating in the themes revered by Blueface's lyrics. It's puzzling that The New York Times, which galvanized the #MeToo movement in 2017 with its <a href=\"https://www.nytimes.com/2017/10/05/us/harvey-weinstein-harassment-allegations.html\" rel=\"nofollow\">investigative reporting</a> into the affairs of Harvey Weinstein, would write a completely <a href=\"https://www.nytimes.com/2019/03/14/arts/music/blueface-thotiana-interview.html\" rel=\"nofollow\">innocuous expose</a> of Blueface's rise to fame.</p>\n<p>The motivation and choice of tone are bewildering. There is, of course, genuine newsworthiness in covering the latest trends in music. But the double standard that’s at play in this case ought to give liberals pause. Consider the following thought experiment: A Hollywood-type in 2019 tweets statements along the lines of Thotiana – either in ernest or in jest – without repercussions. Preposterous. The editorial henchmen at the New York Times – and most other progressive media outlets – would correctly lambast that individual in stride.</p>\n<p>It's notable that Blueface is a young black man. It's also no secret that liberals harbor a sense of guilt about racial inequalities, which generates substantial blind spots about certain realities. The New York Times should call out the perverseness of Blueface's music when it writes about his rise to fame without fear of sounding paternalistic. Not doing so undermines progress and grants a free pass to an entire subculture without rhyme or reason.</p>"},"__N_SSG":true}